<?php

/*
	Copyright (C) 2003-2007 UseBB Team
	http://www.usebb.net
	
	$Header: /cvsroot/usebb/UseBB/languages/faq_English.php,v 1.10 2007/01/01 11:58:43 pc_freak Exp $
	
	This file is part of UseBB.
	
	UseBB is free software; you can redistribute it and/or modify
	it under the terms of the GNU General Public License as published by
	the Free Software Foundation; either version 2 of the License, or
	(at your option) any later version.
	
	UseBB is distributed in the hope that it will be useful,
	but WITHOUT ANY WARRANTY; without even the implied warranty of
	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
	GNU General Public License for more details.
	
	You should have received a copy of the GNU General Public License
	along with UseBB; if not, write to the Free Software
	Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

	This file was translated into Hebrew by Dan_y2k.
	Translation website: http://y2k.official.ws
*/

//
// Die when called directly in browser
//
if ( !defined('INCLUDED') )
	exit();

//
// Initialize a new faq holder array
//
$faq = array();

//
// Define headings and questions
//

$faq[] = array('--', 'חשבונות משתמש');
$faq[] = array('אני צריך להירשם?', 'הרשמה יכולה להיות דרושה כדי לפרסם בקהילה זו, זה תלוי אם מנהלי מערכת הקהילה איפשרו פירסום אורחים או לא (יכול להיות לכל פורום). בכלליות, הרשמה היא רעיון טוב מכיוון שהיא  נותנת לך המון תכונות נוספות.');
$faq[] = array('מה היתרונות של ההרשמה?', 'קודם כל, אתה מקבל חשבון אישי הכינוי שלך שיהיה זמין רק לך. אתה גם מקבל פרופיל אישי שבו אתה יכול לתת קצת מידע נוסף אודותיך אם אתה רוצה ואתה יכול להתאים את הקהילה לפי רצונותיך דרך תכונת העריכת אפשרויות, שיכולה גם לכלול בחירת הגדרות שפה ועיצוב. תכונה מעניינת מאוד היא האפשרות להירשם בתור מנוי לנושאים.');
$faq[] = array('מה אני צריך כדי לרשום חשבון?', 'כדי להירשם, אתה צריך לבחור כינוי (שם משתמש) שיהיה המפתח לחשבונך. אם תרצה, אתה יכול להשתמש גם בשם האמיתי שלך במקום הכינוי שלך. שם לב שאינך יכול לשנות את שם המשתמש שלך בעצמך אחרי ההרשמה, למרות שאתה יכול לשנות את שם התצוגה שלך בכל זמן כל עוד שם המשתמש שלך נשאר אותו הדבר. צריכה גם להיות לך כתובת דואר אלקטרוני עובדת (מכיוון שיכול להיות והיא תהיה דרושה על מנת להפעיל את חשבונך) ואתה חייב לבחור סיסמה (שאתה יכול לשנות אחר כך).');
$faq[] = array('לא קיבלתי את דואר ההפעלה האלקטרוני!', 'אתה יכול להתחבר מבלי להפעיל. אם לא, נסה לבקש סיסמה חדשה. אם זה לא עובד, צור קשר עם מנהל המערכת.');
$faq[] = array('מה אם שכחתי את פרטי ההתחברות שלי או שכתובת הדואר האלקטרוני אינה עובדת יותר?', 'אתה יכול תמיד לבקש סיסמה חדשה דרך הקישור שבטופס ההתחברות. אם כתובת הדואר האלקטרוני שלך לא עובדת יותר או אם שכחת אותה, צור קשר עם מנהל המערכת. הוא/היא יוכלו לתת לך את כתובת הדואר האלקטרוני שאיתה נרשמת או להתאים את חשבונך לכתובת הדואר האלקטרוני החדשה והעובדת שלך.');
$faq[] = array('מהם מנהלי פורומים ומנהלי מערכת?', 'מנהל פורום הוא אדם שבודק אחד או יותר פורומים אחר הודעות לא מדויקות. הוא/היא יכולים גם לעזור למשתמשים בפורום שלהם. מנהל מערכת הוא המנהל של כל הפורומים, והוא/היא יכולים גם להקצות מנהלי פורומים ולשנות את כל אפשרויות התצורה של הקהילה.');
$faq[] = array('איך אני הופך למנהל פורום או מנהל מערכת?', 'בעיקרון, אינך יכול, אבל נסה לשאול את מנהל המערכת אם אתה מעוניין.');
$faq[] = array('אני יכול לשנות את הדרגה שלי?', 'לא, רק מנהלי מערכת יכולים לתת למשתמשים דרגה מותאמת אישית.');

$faq[] = array('--', 'מנויים');
$faq[] = array('איך אני נרשם בתור מנוי לנושאים?', 'בתחתית של כל נושא, אתה תמצא קישור כדי לרשום את עצמך בתור מנוי אליו. אתה יכול להירשם כמנוי רק אם אתה מחובר.');
$faq[] = array('איך אני מבטל את ההרשמה בתור מנוי מנושאים?', 'אתה יכול לבטל את ההרשמה בתור מנוי על ידי לחיצה על הקישור ביטול הרשמה בתור מנוי או דרך סקירה כללית על המנויים בלוח שלך.');

$faq[] = array('--', 'הפרופיל שלך');
$faq[] = array('איך אני יכול לשנות את שם המשתמש שלי?', 'אינך יכול לשנות את שם המשתמש שלך (שם ההתחברות) בעצמך. רק מנהל המערכת מורשה לעשות זאת. למרות זאת אתה יכול את שם התצוגה שלך בכל עת.');
$faq[] = array('מה ההבדל בין שם משתמש, שם תצוגה ושם אמיתי?', 'שם המשתמש שלך, שאתה משתמש בו כדי להתחבר לפורומים, הינו קבוע, אינך יכול לשנות אותו. שם התצוגה שלך (שבעת ההרשמה נרשם בתור שם המשתמש שלך) זה השם שיוצג לציבור. אתה יכול תמיד לשנות שם זה. שים לב שאתה עדיין חייב להתחבר עם שם המשתמש הקבוע שלך. השם האמיתי שלך, שאינו חובה, מוצג רק בעמוד הפרופיל שלך.');
$faq[] = array('השפה שלי חסרה בתיבה הנפתחת!', 'בקש ממנהל המערכת של קהילה זו האם הוא/היא רוצים להוסיף תירגום עבור השפה שלך.');
$faq[] = array('למה אני לא יכול לבחור עיצוב אחר?', 'קרוב לוודאי שאין עיצובים אחרים זמינים בקהילה זו.');

$faq[] = array('--', 'נושאים והודעות');
$faq[] = array('מהם נושאים והודעות?', 'נושא הינו קבוצה של הודעות בפורום מסוים. אם תלחץ על שם הפורום באינדקס הפורומים, אתה תוכל לראות סקירה כללית של נושאים בפורום זה.');
$faq[] = array('מהם נושאים דביקים?', 'נושאים דביקים מעוצבים כדי להיות תמיד בראש סקירת הנושאים הכללית. באופן כללי, משתמשים רגילים לא יכולים ליצור נושאים דביקים, אבל מנהלי פורומים ומנהלי מערכת יכולים.');
$faq[] = array('למה אני לא יכול לפרסם נושאים חדשים או תגובות?', 'אם לא מופיע קישור ליצירת נושאים חדשים או הודעות, אינך מורשה ליצור נושאים חדשים או הודעות בפורום זה. זה יכול להיות או הגדרה של הפורום או שהנושא נסגר על ידי מנהל פורום. אם אתה בספק, צור קשר עם מנהל המערכת.');
$faq[] = array('מהם קוד BB וסמיילים?', 'קוד BB הן תגיות שאתה יכול להשתמש בהן כדי להוסיף יסודות מסוימים להודעה שלך. נסה כמה והצג בתצוגה מקדימה את הודעתך כדי לראות את ההשפעה. בסמיילים אתה יכול להשתמש כדי להביע רגשות בהודעותיך.');
$faq[] = array('מונה ההודעות שלי לא גודל בעת פירסום!', 'בפורומים מסוימים, העלאת מונה ההודעות יכולה להיות מנוטרלת. זה נפוץ עבור ניסיונות או פורומי שיחה כלליים.');
$faq[] = array('למה אני חייב להמתין זמן מסוים בין פירסום?', 'הגנת הצפה משמשת להשמיט זבל או הצפת השרת עם בקשות פירסום. בבקשה המתן לרגע ושלח מחדש את ההודעה.');

$faq[] = array('--', 'שונות');
$faq[] = array('אני לא מקבל הודעות דואר אלקטרוני כלשהן מקהילה זו!', 'וודא שהודעות הדואר האלקטרוני אינן נחסמות על ידי תוכנה למניעת דואר זבל. אם לא, יכול להיות שכתובת הדואר האלקטרוני שנקבעה בפרופיל לא עובדת יותר.');
$faq[] = array('מהי הזנת RSS?', 'הזנות RSS משמשות להצגת מידע חדש מאתר אינטרנט או פורום לצפייה בקורא חדשות/RSS או כמה דפדפנים.');
$faq[] = array('איפה בפרופיל שלי אני יכול למקם את חשבון ה-Google Talk שלי?', 'Google Talk הינה רשת מסרים מיידיים שמשתמשת בפרוטוקול ה-Jabber/XMPP. אתה יכול למקם את שם החשבון שלך (במלואו, כולל שם הדומיין) בשדה הפרופיל Jabber/XMPP.');

$faq[] = array('--', 'UseBB Issues');
$faq[] = array('Who made this forum? What is UseBB?', 'This bulletin board, called <em>UseBB</em>, is developed by the UseBB Team. UseBB is Open Source software released under the GPL. You can download UseBB for free from <a href="http://www.usebb.net">www.usebb.net</a>. Note the administrator(s) of this forum/website may have added additional functionality.');
$faq[] = array('Are the creators of UseBB responsible for this forum?', 'No, this board is maintained by the website\'s webmaster(s). The UseBB Team can not be held responsible for this forum in any way.');
$faq[] = array('I have a complaint about this forum. To whom should I direct?', 'If you have a complaint about the forum software itself, not the content, you are welcome to <a href="http://www.usebb.net">tell the UseBB Team</a>. For any other inquiries, please contact the administrator(s) of this forum/website.');

$faq[] = array('--', 'שאלות בקשר לגירסה העברית');
$faq[] = array('UseBB Issues לא מתורגם. למה?', 'מכיוון שרצינו לשמור על זכויות היוצרים המקוריות, העדפנו לא לתרגם חלק זה.');
$faq[] = array('מי תירגם את המערכת הזו?', 'מערכת זו תורגמה לעברית על ידי צוות UseBBHeb.');
$faq[] = array('מאיפה ניתן להוריד את המערכת המתורגמת?', 'ניתן להוריד את קבצי השפה העברית של המערכת מהכתובת <a href="http://y2k.official.ws" target="_blank">http://y2k.official.ws</a>.');
$faq[] = array('זכר ונקבה', 'התירגום מנוסח בלשון זכר, אך מיועד לשני המינים.');
$faq[] = array('יש לי מה להגיד על התירגום', 'אם יש לך מה להגיד לנו כמו שאלות, הצעות, הערות בקשות וכדומה, אתה מוזמן לפנות לאתר הבית שלנו: <a href="http://y2k.official.ws" target="_blank">http://y2k.official.ws</a>.');
$faq[] = array('ראיתי אתר שהוריד את זכויות התירגום שלכם, מה לעשות?', 'דווח לנו על ידי לחיצה <a href="mailto:danny.y2k@gmail.com?subject=הורדת זכויות התירגום של UseBB">כאן</a> וציין את כתובתו של האתר שהוריד את זכויות התירגום. תודה!');

?>
